; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p16---int100n150-m25---int100c110---s447---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level17 level17)
(sum level0 level18 level18)
(sum level1 level4 level5)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level17 level18)
(sum level1 level18 level19)
(sum level2 level4 level6)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level17 level19)
(sum level2 level18 level20)
(sum level3 level4 level7)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level17 level20)
(sum level3 level18 level21)
(sum level4 level4 level8)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level17 level21)
(sum level4 level18 level22)
(sum level5 level4 level9)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level17 level22)
(sum level5 level18 level23)
(sum level6 level4 level10)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level17 level23)
(sum level6 level18 level24)
(sum level7 level4 level11)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level17 level24)
(sum level7 level18 level25)
(sum level8 level4 level12)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level17 level25)
(sum level8 level18 level26)
(sum level9 level4 level13)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level17 level26)
(sum level9 level18 level27)
(sum level10 level4 level14)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level17 level27)
(sum level10 level18 level28)
(sum level11 level4 level15)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level17 level28)
(sum level11 level18 level29)
(sum level12 level4 level16)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level17 level29)
(sum level12 level18 level30)
(sum level13 level4 level17)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level17 level30)
(sum level13 level18 level31)
(sum level14 level4 level18)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level17 level31)
(sum level14 level18 level32)
(sum level15 level4 level19)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level17 level32)
(sum level15 level18 level33)
(sum level16 level4 level20)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level17 level33)
(sum level16 level18 level34)
(sum level17 level4 level21)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level17 level34)
(sum level17 level18 level35)
(sum level18 level4 level22)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level17 level35)
(sum level18 level18 level36)
(sum level19 level4 level23)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level17 level36)
(sum level19 level18 level37)
(sum level20 level4 level24)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level17 level37)
(sum level20 level18 level38)
(sum level21 level4 level25)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level17 level38)
(sum level21 level18 level39)
(sum level22 level4 level26)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level17 level39)
(sum level22 level18 level40)
(sum level23 level4 level27)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level17 level40)
(sum level23 level18 level41)
(sum level24 level4 level28)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level17 level41)
(sum level24 level18 level42)
(sum level25 level4 level29)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level17 level42)
(sum level25 level18 level43)
(sum level26 level4 level30)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level17 level43)
(sum level26 level18 level44)
(sum level27 level4 level31)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level17 level44)
(sum level27 level18 level45)
(sum level28 level4 level32)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level17 level45)
(sum level28 level18 level46)
(sum level29 level4 level33)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level17 level46)
(sum level30 level4 level34)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level31 level4 level35)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level32 level4 level36)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level33 level4 level37)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level34 level4 level38)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level35 level4 level39)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level36 level4 level40)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level37 level4 level41)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level38 level4 level42)
(sum level38 level8 level46)
(sum level39 level4 level43)
(sum level40 level4 level44)
(sum level41 level4 level45)
(sum level42 level4 level46)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level18 l0 l2)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l1 l3)
(fuelcost level17 l1 l3)
(connected l2 l0)
(fuelcost level18 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)
(connected l2 l3)
(fuelcost level8 l2 l3)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l1)
(fuelcost level17 l3 l1)
(connected l3 l2)
(fuelcost level8 l3 l2)

(at t0 l2)
(fuel t0 level46)
(= (total-cost) 0)

(at p0 l1)
(at p1 l1)
(at p2 l3)
(at p3 l1)
(at p4 l2)
(at p5 l3)
(at p6 l3)
(at p7 l3)
(at p8 l0)
(at p9 l1)
(at p10 l1)
(at p11 l1)
(at p12 l0)
(at p13 l1)
(at p14 l2)
(at p15 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l0)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l1)
(at p8 l2)
(at p9 l3)
(at p10 l2)
(at p11 l2)
(at p12 l2)
(at p13 l3)
(at p14 l1)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 16
2. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 0 of 16
3. (drive t0 l2 l3 level38 level8 level46)
   deleted: (at t0 l2) (fuel t0 level46)
   added: (at t0 l3) (fuel t0 level38)
   goals met: 0 of 16
4. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 16
5. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 16
6. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 16
7. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 16
8. (drive t0 l3 l1 level21 level17 level38)
   deleted: (at t0 l3) (fuel t0 level38)
   added: (at t0 l1) (fuel t0 level21)
   goals met: 0 of 16
9. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 1 of 16
10. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 2 of 16
11. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 2 of 16
12. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 2 of 16
13. (load p13 t0 l1)
   deleted: (at p13 l1)
   added: (in p13 t0)
   goals met: 2 of 16
14. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 2 of 16
15. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 2 of 16
16. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 2 of 16
17. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 2 of 16
18. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 3 of 16
19. (drive t0 l1 l0 level12 level9 level21)
   deleted: (at t0 l1) (fuel t0 level21)
   added: (at t0 l0) (fuel t0 level12)
   goals met: 3 of 16
20. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 3 of 16
21. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 3 of 16
22. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 3 of 16
23. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 4 of 16
24. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 16
25. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 6 of 16
26. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 7 of 16
27. (unload p6 t0 l0)
   deleted: (in p6 t0)
   added: (at p6 l0)
   goals met: 8 of 16
28. (drive t0 l0 l3 level8 level4 level12)
   deleted: (at t0 l0) (fuel t0 level12)
   added: (at t0 l3) (fuel t0 level8)
   goals met: 8 of 16
29. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 9 of 16
30. (unload p13 t0 l3)
   deleted: (in p13 t0)
   added: (at p13 l3)
   goals met: 10 of 16
31. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 11 of 16
32. (drive t0 l3 l2 level0 level8 level8)
   deleted: (at t0 l3) (fuel t0 level8)
   added: (at t0 l2) (fuel t0 level0)
   goals met: 11 of 16
33. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 12 of 16
34. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 13 of 16
35. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 14 of 16
36. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 15 of 16
37. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 16 of 16
